node {
  name: "Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999974752427e-07
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 3.1415927410125732
      }
    }
  }
}
node {
  name: "InputSpectralFrame/input_producer/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1458
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1458
          }
        }
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100117.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100144.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100146.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100145.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100064.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100065.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100003.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100074.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100126.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100022.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100150.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100112.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100127.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100034.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100090.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100118.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100100.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100158.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100156.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100120.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100048.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100083.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100005.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100132.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100016.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100094.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100030.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100104.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100052.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100021.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100149.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100143.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100006.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100076.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100084.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100123.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100014.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100071.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100061.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100075.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100038.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100073.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100154.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100007.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100135.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100082.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100085.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100092.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100017.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100106.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100037.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100049.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100012.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100039.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100032.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100047.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100088.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100091.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100098.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100138.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100036.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100045.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100130.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100110.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100055.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100131.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100051.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100077.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100079.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100066.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100111.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100060.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100134.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100041.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100103.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100161.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100020.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100058.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100095.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100013.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100142.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100136.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100108.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100124.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100078.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100024.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100105.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100027.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100081.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100099.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100139.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100068.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100026.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100044.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100063.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100128.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100023.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100069.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100102.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100153.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100056.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100043.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100148.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100089.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100018.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100019.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100062.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100046.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100070.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100059.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100129.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100155.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100008.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100157.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100159.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100054.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100001.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100133.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100115.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100029.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100010.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100057.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100004.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100160.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100009.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100015.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100097.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100141.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100109.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100028.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100002.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100125.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100087.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100033.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100042.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100035.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100147.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100151.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100114.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100096.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100140.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100031.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100053.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100101.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100086.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100080.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100137.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100025.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100011.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100119.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100067.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100107.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100050.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100113.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100162.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100093.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100122.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100040.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100116.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100072.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100152.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM1/100121.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100117.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100144.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100146.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100145.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100064.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100065.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100003.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100074.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100126.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100022.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100150.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100112.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100127.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100034.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100090.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100118.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100100.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100158.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100156.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100120.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100048.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100083.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100005.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100132.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100016.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100094.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100030.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100104.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100052.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100021.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100149.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100143.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100006.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100076.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100084.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100123.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100014.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100071.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100061.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100075.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100038.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100073.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100154.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100007.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100135.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100082.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100085.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100092.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100017.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100106.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100037.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100049.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100012.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100039.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100032.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100047.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100088.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100091.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100098.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100138.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100036.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100045.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100130.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100110.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100055.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100131.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100051.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100077.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100079.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100066.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100111.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100060.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100134.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100041.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100103.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100161.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100020.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100058.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100095.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100013.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100142.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100136.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100108.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100124.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100078.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100024.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100105.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100027.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100081.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100099.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100139.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100068.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100026.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100044.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100063.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100128.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100023.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100069.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100102.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100153.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100056.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100043.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100148.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100089.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100018.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100019.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100062.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100046.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100070.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100059.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100129.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100155.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100008.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100157.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100159.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100054.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100001.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100133.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100115.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100029.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100010.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100057.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100004.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100160.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100009.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100015.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100097.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100141.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100109.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100028.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100002.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100125.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100087.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100033.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100042.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100035.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100147.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100151.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100114.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100096.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100140.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100031.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100053.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100101.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100086.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100080.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100137.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100025.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100011.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100119.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100067.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100107.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100050.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100113.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100162.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100093.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100122.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100040.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100116.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100072.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100152.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SM1/100121.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100117.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100144.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100146.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100145.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100064.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100065.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100003.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100074.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100126.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100022.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100150.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100112.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100127.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100034.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100090.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100118.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100100.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100158.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100156.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100120.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100048.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100083.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100005.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100132.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100016.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100094.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100030.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100104.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100052.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100021.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100149.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100143.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100006.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100076.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100084.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100123.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100014.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100071.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100061.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100075.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100038.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100073.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100154.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100007.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100135.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100082.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100085.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100092.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100017.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100106.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100037.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100049.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100012.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100039.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100032.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100047.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100088.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100091.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100098.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100138.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100036.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100045.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100130.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100110.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100055.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100131.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100051.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100077.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100079.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100066.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100111.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100060.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100134.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100041.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100103.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100161.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100020.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100058.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100095.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100013.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100142.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100136.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100108.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100124.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100078.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100024.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100105.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100027.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100081.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100099.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100139.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100068.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100026.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100044.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100063.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100128.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100023.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100069.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100102.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100153.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100056.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100043.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100148.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100089.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100018.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100019.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100062.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100046.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100070.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100059.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100129.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100155.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100008.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100157.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100159.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100054.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100001.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100133.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100115.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100029.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100010.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100057.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100004.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100160.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100009.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100015.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100097.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100141.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100109.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100028.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100002.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100125.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100087.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100033.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100042.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100035.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100147.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100151.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100114.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100096.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100140.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100031.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100053.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100101.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100086.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100080.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100137.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100025.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100011.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100119.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100067.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100107.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100050.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100113.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100162.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100093.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100122.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100040.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100116.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100072.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100152.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF3/100121.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100117.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100144.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100146.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100145.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100064.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100065.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100003.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100074.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100126.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100022.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100150.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100112.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100127.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100034.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100090.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100118.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100100.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100158.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100156.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100120.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100048.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100083.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100005.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100132.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100016.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100094.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100030.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100104.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100052.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100021.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100149.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100143.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100006.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100076.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100084.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100123.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100014.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100071.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100061.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100075.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100038.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100073.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100154.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100007.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100135.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100082.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100085.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100092.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100017.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100106.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100037.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100049.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100012.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100039.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100032.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100047.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100088.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100091.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100098.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100138.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100036.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100045.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100130.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100110.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100055.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100131.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100051.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100077.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100079.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100066.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100111.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100060.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100134.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100041.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100103.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100161.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100020.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100058.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100095.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100013.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100142.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100136.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100108.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100124.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100078.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100024.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100105.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100027.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100081.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100099.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100139.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100068.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100026.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100044.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100063.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100128.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100023.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100069.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100102.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100153.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100056.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100043.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100148.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100089.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100018.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100019.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100062.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100046.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100070.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100059.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100129.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100155.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100008.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100157.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100159.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100054.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100001.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100133.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100115.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100029.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100010.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100057.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100004.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100160.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100009.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100015.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100097.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100141.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100109.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100028.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100002.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100125.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100087.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100033.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100042.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100035.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100147.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100151.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100114.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100096.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100140.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100031.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100053.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100101.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100086.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100080.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100137.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100025.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100011.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100119.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100067.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100107.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100050.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100113.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100162.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100093.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100122.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100040.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100116.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100072.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100152.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/TM3/100121.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100117.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100144.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100146.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100145.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100064.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100065.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100003.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100074.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100126.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100022.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100150.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100112.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100127.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100034.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100090.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100118.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100100.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100158.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100156.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100120.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100048.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100083.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100005.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100132.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100016.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100094.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100030.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100104.bin"
        string_val: "./dataset/vcc2016/bin/Training Set/SF1/100052.bin"
